Revit 2027 API
FilledRegion.IsValidFilledRegionTypeId Method
 Indicates whether the given Id is a valid filled region type Id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidFilledRegionTypeId(
	Document document,
	ElementId typeId
)
Public Shared Function IsValidFilledRegionTypeId (
	document As Document,
	typeId As ElementId
) As Boolean
public:
static bool IsValidFilledRegionTypeId(
	Document^ document,
	ElementId^ typeId
)
static member IsValidFilledRegionTypeId :
        document : Document *
        typeId : ElementId -> bool
Parameters
document Document
 The document.
typeId ElementId
 The filled region type Id.
Return Value
Boolean
 True if it is a valid filled region type Id, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FilledRegion Class
Autodesk.Revit.DB Namespace